map_scancodes_keycodes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-22 Tue 16:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Map scancodes to keycodes</title>
<meta name="author" content="Roi Martin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Map scancodes to keycodes</h1>
<div id="outline-container-org69a7bd6" class="outline-2">
<h2 id="org69a7bd6">Scancodes vs keycodes</h2>
<div class="outline-text-2" id="text-org69a7bd6">
<ul class="org-ul">
<li><b>Scancode</b>: the keyboard sends a scancode to the computer.</li>
<li><b>Keycode</b>: the kernel maps the scancode to a keycode.</li>
</ul>
</div>
</div>
<div id="outline-container-orge17f188" class="outline-2">
<h2 id="orge17f188">Mapping</h2>
<div class="outline-text-2" id="text-orge17f188">
</div>
<div id="outline-container-org2849060" class="outline-3">
<h3 id="org2849060">Get the scancodes</h3>
<div class="outline-text-3" id="text-org2849060">
<p>
Run the following command as root:
</p>

<div class="org-src-container">
<pre class="src src-shell">evtest
</pre>
</div>

<p>
And select the input device that corresponds to the keyboard.  Then,
press the keys that you want to map.  For instance,
</p>

<pre class="example" id="org3b5bf9b">
Event: time 1753187771.746790, type 4 (EV_MSC), code 4 (MSC_SCAN), value 70004
Event: time 1753187771.746790, type 1 (EV_KEY), code 30 (KEY_A), value 
</pre>

<p>
The previous output shows that the scancode for the <code>a</code> key is
<code>70004</code>.
</p>
</div>
</div>
<div id="outline-container-org3d9435d" class="outline-3">
<h3 id="org3d9435d">Get the device modalias</h3>
<div class="outline-text-3" id="text-org3d9435d">
<p>
If the selected device is, for instance, <code>/dev/input/event6</code>, then get
the modalias with the following command:
</p>

<div class="org-src-container">
<pre class="src src-shell">cat /sys/class/input/event6/device/modalias
</pre>
</div>

<p>
The output should be similar to this:
</p>

<pre class="example" id="org5bbc1a3">
input:b0003v0853p0146e0111-e0,1,4,11,...
</pre>

<p>
We will need it to create the <code>hwdb</code> file.
</p>
</div>
</div>
<div id="outline-container-orgd37dcfa" class="outline-3">
<h3 id="orgd37dcfa">Create a hwdb file</h3>
<div class="outline-text-3" id="text-orgd37dcfa">
<p>
Create a file named <code>/etc/udev/hwdb.d/99-keyboard.hwdb</code>.  The content
for the previous example should be similar to this:
</p>

<pre class="example" id="orge223a10">
# Topre REALFORCE 87 US
# Input device ID: bus 0x03 vendor 0x853 product 0x146 version 0x111
evdev:input:b0003v0853p0146e0111*
 KEYBOARD_KEY_700e0=leftmeta  # leftctrl  -&gt; leftmeta
 KEYBOARD_KEY_700e3=leftalt   # leftmeta  -&gt; leftalt
 KEYBOARD_KEY_700e2=leftctrl  # leftalt   -&gt; leftctrl
 KEYBOARD_KEY_700e6=rightctrl # rightalt  -&gt; rightctrl
 KEYBOARD_KEY_700e7=rightalt  # rightmeta -&gt; rightalt
 KEYBOARD_KEY_700e4=rightmeta # rightctrl -&gt; rightmeta
</pre>

<p>
It is a list of records with the following format:
</p>

<pre class="example" id="org27f98a3">
&lt;modalias pattern&gt;
 KEYBOARD_KEY_&lt;scancode&gt;=&lt;keycode&gt;
 ...
</pre>

<p>
The scancode should be expressed in hex lowercase.  The keycodes are
retrieved and normalized from the <a href="https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/tree/include/uapi/linux/input-event-codes.h?id=67890d579402804b1d32b3280d9860073542528e">kernel input API header</a>. Keycodes
are either <code>KEY_*</code> defines in lowercase with the <code>key_</code> prefix
optionally removed or <code>BTN_</code> defines in lowercase with <code>btn_</code>
preserved.
</p>

<p>
See <code>hwdb(7)</code> and <a href="https://github.com/systemd/systemd/blob/72775b7c89aa418ec3f55fd5682f841f3fc6e6d9/hwdb.d/60-keyboard.hwdb">60-keyboard.hwdb</a> for more details.
</p>
</div>
</div>
<div id="outline-container-org55c96bd" class="outline-3">
<h3 id="org55c96bd">Update the binary hwdb</h3>
<div class="outline-text-3" id="text-org55c96bd">
<p>
Run the following command as root:
</p>

<div class="org-src-container">
<pre class="src src-shell">systemd-hwdb update
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb91e8b1" class="outline-3">
<h3 id="orgb91e8b1">Reload the binary hwdb</h3>
<div class="outline-text-3" id="text-orgb91e8b1">
<p>
Run the following command as root:
</p>

<div class="org-src-container">
<pre class="src src-shell">udevadm trigger
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-07-22 Tue 00:00</p>
<p class="author">Author: Roi Martin</p>
<p class="date">Created: 2025-07-22 Tue 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
